In [1]:
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
fuel = pd.read_csv('fuel_cleaned.csv', index_col = 0)

In [4]:
# get shape and length
print(fuel.shape)
db_length = fuel.shape[0]

(3025, 25)

In [5]:
fuel.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3025 entries, 1 to 3034
Data columns (total 25 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   month              3025 non-null   int64
 1   airline_id         3025 non-null   float64
 2   unique_carrier     3025 non-null   object
 3   carrier            3025 non-null   object
 4   carrier_name       3025 non-null   object
 5   carrier_group_new  3025 non-null   int64
 6   sdomt_gallons      3025 non-null   float64
 7   satl_gallons       3025 non-null   float64
 8   spac_gallons       3025 non-null   float64
 9   slat_gallons       3025 non-null   float64
 10  sint_gallons       3025 non-null   float64
 11  ts_gallons         3025 non-null   float64
 12  tdomt_gallons      3025 non-null   float64
 13  tint_gallons       3025 non-null   float64
 14  total_gallons      3025 non-null   float64
 15  sdomt_cost         3025 non-null   float64
 16  satl_cost          3025 non-null   float64
 17  spac_cost          3025 non-null   float64
 18  slat_cost          3025 non-null   float64
 19  sint_cost          3025 non-null   float64
 20  ts_cost            3025 non-null   float64
 21  tdomt_cost         3025 non-null   float64
 22  tint_cost          3025 non-null   float64
 23  total_cost         3025 non-null   float64
 24  year               3025 non-null   int64
dtypes: float64(19), int64(3), object(3)
memory usage: 614.5+ KB

In [10]:
# explore all columns
fuel.iloc[:5, :10]

,month,airline_id,unique_carrier,carrier,carrier_name,carrier_group_new,sdomt_gallons,satl_gallons,spac_gallons,slat_gallons
1,1,21352.0,0WQ,0WQ,Avjet Corporation,1,0.0,0.0,0.0,0.0
2,1,21645.0,23Q,23Q,Songbird Airways Inc.,1,0.0,0.0,0.0,0.0
3,1,21652.0,27Q,27Q,"Jet Aviation Flight Services, Inc.",1,0.0,0.0,0.0,0.0
4,1,20408.0,5V,5V,Tatonduk Outfitters Limited d/b/a Everts Air A...,1,260848.0,0.0,0.0,0.0
5,1,19917.0,5X,5X,United Parcel Service,3,32138000.0,9743000.0,16116000.0,2972000.0

In [8]:
fuel.iloc[:5, 10:20]

,sint_gallons,ts_gallons,tdomt_gallons,tint_gallons,total_gallons,sdomt_cost,satl_cost,spac_cost,slat_cost,sint_cost
1,0.0,0.0,163052.0,47060.0,210112.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,260848.0,284362.0,0.0,284362.0,522405.0,0.0,0.0,0.0,0.0
5,28831000.0,60969000.0,32138000.0,28831000.0,60969000.0,34098000.0,9752000.0,17965000.0,3524000.0,31241000.0

In [9]:
fuel.iloc[:5, 20:]

      ts_cost  tdomt_cost   tint_cost  total_cost  year
1         0.0    396216.0    140239.0    536455.0  2016
2         0.0         0.0         0.0         0.0  2016
3         0.0         0.0         0.0         0.0  2016
4    522405.0    569497.0         0.0    569497.0  2016
5  65339000.0  34098000.0  31241000.0  65339000.0  2016

# Numerical data

In [13]:
numeric_features = fuel.select_dtypes(include=[np.number])
numeric_features.columns

Index(['month', 'airline_id', 'carrier_group_new', 'sdomt_gallons',
       'satl_gallons', 'spac_gallons', 'slat_gallons', 'sint_gallons',
       'ts_gallons', 'tdomt_gallons', 'tint_gallons', 'total_gallons',
       'sdomt_cost', 'satl_cost', 'spac_cost', 'slat_cost', 'sint_cost',
       'ts_cost', 'tdomt_cost', 'tint_cost', 'total_cost', 'year'],
      dtype='object')

In [14]:
# see if variables are categorical / continuous: look at number of unique values for each feature
for column in numeric_features.columns:
    print(column, len(fuel[column].unique()))

month 12
airline_id 62
carrier_group_new 3
sdomt_gallons 1420
satl_gallons 405
spac_gallons 455
slat_gallons 731
sint_gallons 892
ts_gallons 1486
tdomt_gallons 2275
tint_gallons 1863
total_gallons 2398
sdomt_cost 1409
satl_cost 405
spac_cost 455
slat_cost 730
sint_cost 893
ts_cost 1475
tdomt_cost 2265
tint_cost 1863
total_cost 2385
year 5

# String data

In [19]:
string_data = fuel.dtypes[fuel.dtypes == 'object'].index
string_data

Index(['unique_carrier', 'carrier', 'carrier_name'], dtype='object')

# Drop redundant features

In [21]:
# redundant: keeping unique_carrier

fuel = fuel.drop('carrier', axis = 1)

# Other EDA

In [27]:
# Check if year/month/airlineID is the unique key of this db

len(fuel.groupby(['year', 'month', 'airline_id']).count())

3025

In [28]:
len(fuel.groupby(['airline_id']).count())

62